# Join Practice

We will make use of the employee database for this assignment.  You will get lots of practice with joins and natural joins.  You only have to provide your answer in SQL, but you may find it useful to draw out the relational algebra to help you organize your thinking.

### Due:  See Syllabus

In [1]:
import warnings
warnings.filterwarnings('ignore')
#from sols3 import *

In [2]:
%load_ext sql

In [3]:
%sql postgresql://osmaah02:@localhost/employees

'Connected: osmaah02@employees'

### 1. List the first and last name and hire date of each employee in the Sales Department hired before Feb 7, 1985 ordered by hire date

In [4]:
#Go after all those who have ever been in the sales department 
#hired before 2/7/1985
#80 rows not 55

In [5]:
%%sql

SELECT first_name, last_name, hire_date 
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE dept_name = 'Sales' AND hire_date<'1985-02-07'
AND now()<to_date
ORDER BY hire_date; --this gets all those currently in the sales dept hired before Feb 7, 1985
-- checker wants all in the sales dept hired before Feb 7, 1985 regardless of whether they are there now or not

55 rows affected.

[('Przemyslawa', 'Kaelbling', datetime.date(1985, 1, 1)),
 ('Yongdong', 'Pileggi', datetime.date(1985, 2, 1)),
 ('Shir', 'Munck', datetime.date(1985, 2, 1)),
 ('Adil', 'Furedi', datetime.date(1985, 2, 1)),
 ('Chaosheng', 'Sommen', datetime.date(1985, 2, 2)),
 ('Guenter', 'Tanemo', datetime.date(1985, 2, 2)),
 ('Erzsebet', 'Schwartzbauer', datetime.date(1985, 2, 2)),
 ('Gay', 'Kumaresan', datetime.date(1985, 2, 2)),
 ('Limsoon', 'Macedo', datetime.date(1985, 2, 2)),
 ('Holgard', 'Pena', datetime.date(1985, 2, 2)),
 ('Xinglin', 'Marakhovsky', datetime.date(1985, 2, 2)),
 ('Kousuke', 'Swist', datetime.date(1985, 2, 2)),
 ('Chikako', 'Malabarba', datetime.date(1985, 2, 2)),
 ('Zita', 'Vural', datetime.date(1985, 2, 3)),
 ('Fumitaka', 'Boyle', datetime.date(1985, 2, 3)),
 ('Huan', 'Dahlbom', datetime.date(1985, 2, 3)),
 ('Mitchel', 'Gustavson', datetime.date(1985, 2, 3)),
 ('Godehard', 'Conte', datetime.date(1985, 2, 3)),
 ('Premsyl', 'Nitto', datetime.date(1985, 2, 3)),
 ('Halsur', 'Birrer', datetime.date(1985, 2, 3)),
 ('Chiranjit', 'Stemann', datetime.date(1985, 2, 3)),
 ('Nectarios', 'Perna', datetime.date(1985, 2, 3)),
 ('Fumiyo', 'Cronau', datetime.date(1985, 2, 3)),
 ('Shakhar', 'Sgarro', datetime.date(1985, 2, 3)),
 ('Stafford', 'Luce', datetime.date(1985, 2, 4)),
 ('Goa', 'Parfitt', datetime.date(1985, 2, 4)),
 ('Eberhardt', 'Pramanik', datetime.date(1985, 2, 4)),
 ('Khalid', 'Salinas', datetime.date(1985, 2, 4)),
 ('Tran', 'Jiang', datetime.date(1985, 2, 4)),
 ('Fox', 'Waschkowski', datetime.date(1985, 2, 4)),
 ('Xiong', 'Chenoweth', datetime.date(1985, 2, 4)),
 ('Arto', 'Argence', datetime.date(1985, 2, 4)),
 ('Limsoon', 'Bage', datetime.date(1985, 2, 5)),
 ('Goh', 'Linnainmaa', datetime.date(1985, 2, 5)),
 ('Chiranjit', 'Ghelli', datetime.date(1985, 2, 5)),
 ('Boutros', 'Velardi', datetime.date(1985, 2, 5)),
 ('Gregory', 'Griswold', datetime.date(1985, 2, 5)),
 ('Niteen', 'Matteis', datetime.date(1985, 2, 5)),
 ('Vasilis', 'Pettis', datetime.date(1985, 2, 5)),
 ('Rance', 'Chepyzhov', datetime.date(1985, 2, 5)),
 ('Jaques', 'Hashii', datetime.date(1985, 2, 5)),
 ('Goa', 'Swick', datetime.date(1985, 2, 5)),
 ('Ramalingam', 'Validov', datetime.date(1985, 2, 5)),
 ('Bedrich', 'Lubachevsky', datetime.date(1985, 2, 5)),
 ('Ohad', 'Srimani', datetime.date(1985, 2, 5)),
 ('Amalendu', 'Hiyoshi', datetime.date(1985, 2, 5)),
 ('Nakhoon', 'Falby', datetime.date(1985, 2, 6)),
 ('Adil', 'Uludag', datetime.date(1985, 2, 6)),
 ('Horward', 'Steenbeek', datetime.date(1985, 2, 6)),
 ('Pragnesh', 'Orlowska', datetime.date(1985, 2, 6)),
 ('Xiaoqiang', 'Ferriere', datetime.date(1985, 2, 6)),
 ('Noritoshi', 'Luff', datetime.date(1985, 2, 6)),
 ('Hugo', 'Griswold', datetime.date(1985, 2, 6)),
 ('Uriel', 'Daescu', datetime.date(1985, 2, 6)),
 ('Dhritiman', 'Masamoto', datetime.date(1985, 2, 6))]

In [6]:
#Importing pandas library - used for converting users' result to a DataFrame ojbect
import pandas

#Importing create_engine method - used for connecting to the regarded database
from sqlalchemy import create_engine

#Connecting to the database in which the queries are made on - employees or movies
databaseEngine = create_engine('postgresql://millbr02:@localhost/employees')

#Converting student's query result into a DataFrame object that can be checked
def toDataFrame(result):
    return pandas.DataFrame(result, columns=(result and result.keys) or [])

#Checking columns' number
def colNumCheck(result, query):
    if len(list(query.columns)) != len(list(result.columns)):
        print("Error! You have a different number of columns than expected.")
        print("Number of columns expected:", len(list(query.columns)) +'.')
        assert False

#Checking columns' names
def colNameCheck(result, query):
    if list(query.columns) != list(result.columns):
        print("Error! Did you name the columns correctly?")
        print("Columns' names expected:", ', '.join(list(query.columns)) + '.')
        assert False

#Checking rows number
def rowNumCheck(result, query):
    if type(query) != list:
        query = [query]    
    rowNum = [len(a) == len(result) for a in query]
    if not any(rowNum):
        ix = rowNum.index(False)
        print("Error! Results are not the same length. I was expecting {} rows and your result has {} rows.".format(len(query[ix]),len(result)))
        assert False

#Comparing the data within each row
def rowDataCheck(result, query):
    query = query.values.tolist()
    result = result.values.tolist()
    
    differences = 0

    for rowQuery in query:
        if result[query.index(rowQuery)] != rowQuery:
            differences += 1

    if differences > 0:
        if(rowSortedCheck(result, query) == False):
            return False

#Comparing sorted data for each row
def rowSortedCheck(result, query):
    query.sort()
    result.sort()
    
    differences = 0

    for rowQuery in query:
        rowNum = query.index(rowQuery)
        if result[rowNum] != rowQuery:
          differences += 1
    
    if differences == 0:
        print("Error! The data shape is correct, but not matching the final results. Did you order?")
        assert False
    elif differences > 0:
        print("Error! Line by line comparison shows that your query is invalid. Read the question carefully.")
        print("Your solution should be like the following table:")
        return False

#Displaying the difference between the query's rows and the result's rows
def showDiff(query):
    print(query)
    print()
    assert False

#The checker calling method for SQL
def checkSQL(result, query):
    result = toDataFrame(result)

    #If there is only one approved solution for this answer, it must be a list
    if type(query) != list:
        query = [query] 
    
    #Comparing the result with the solution query
    query = pandas.read_sql_query(query[0], databaseEngine)

    colNumCheck(result, query)
    colNameCheck(result, query)
    rowNumCheck(result, query)
    if(rowDataCheck(result, query) == False):
        showDiff(query)
    
    print("Correct!")

#The checker calling method for RA
def checkRA(result, query):
    colNumCheck(result, query)
    colNameCheck(result, query)
    rowNumCheck(result, query)
    rowDataCheck(result, query)

    print("Correct!")

###########################################################################################################################################################

def checker_1(got):
    q = '''
SELECT first_name, last_name, hire_date 
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE dept_name = 'Sales' AND hire_date<'1985-02-07'
AND now()<to_date
ORDER BY hire_date; --this gets all those currently in the sales dept hired before Feb 7, 1985
-- checker wants all in the sales dept hired before Feb 7, 1985 regardless of whether they are there now or not
    '''
    checkSQL(got,q)

def checker_2(got):
    q = '''
SELECT dept_name, COUNT(*) 
FROM departments NATURAL JOIN dept_emp
WHERE  now()<to_date
GROUP BY (dept_name)
ORDER BY COUNT(*) 
; --this first creates an intermediate result of all the emp dept instances and then filters for those current
-- can count the instances w/o knowing the names
    '''
    checkSQL(got,q)

def checker_3(got):
    q = '''
SELECT COUNT(*) 
FROM departments NATURAL JOIN dept_emp
WHERE dept_name = 'Research'AND now() > to_date
; -- if an employee has come in and out of research and no longer works there, how many times were they counted?
    '''
    checkSQL(got,q)

def checker_4(got):
    q = '''
SELECT dept_name, MAX(hire_date)
FROM  departments 
  NATURAL JOIN dept_emp 
  NATURAL JOIN employees
GROUP BY dept_name 

-- this gets the last employee hire date of anyone that has ever worked in each dept 


;
    '''
    checkSQL(got,q)

def checker_5(got):
    q = '''
SELECT first_name, last_name, from_date, to_date
FROM departments NATURAL JOIN dept_manager NATURAL JOIN employees
WHERE dept_name = 'Customer Service'
ORDER BY from_date
;
    '''
    checkSQL(got,q)

def checker_6(got):
    q = '''
SELECT first_name, last_name, salary
FROM salaries 
  NATURAL JOIN employees
WHERE now()<to_date
ORDER BY salary DESC
LIMIT(10) --this gives currrent employees, we could get all time (including those no longer at firm) if we drop where
;
    '''
    checkSQL(got,q)


def checker_7(got):
    q = '''
SELECT DISTINCT first_name, last_name, salary, title --could be someone got a new title without a salary increase
FROM employees 
  NATURAL JOIN salaries 
  JOIN titles ON employees.emp_no = titles.emp_no
WHERE now()< salaries.to_date AND now()<titles.to_date
ORDER BY salary DESC 
LIMIT(10) --this gives currrent employees, 
--we could get all time (including those no longer at firm)
;
    '''
    checkSQL(got,q)

def checker_8(got):
    q = '''
SELECT DISTINCT first_name, last_name, salary, dept_name
FROM employees 
  NATURAL JOIN dept_emp 
  NATURAL JOIN departments 
  JOIN salaries ON employees.emp_no = salaries.emp_no
WHERE now()< salaries.to_date 
ORDER BY salary  
LIMIT(10) 
; -- currently employed and current salary...perhaps/likely many had lower salaries in the past
    '''
    checkSQL(got,q)

def checker_9(got):
    q = '''
SELECT TO_CHAR(AVG(salary), '999,999.99')
FROM  departments 
  NATURAL JOIN dept_emp 
  NATURAL JOIN employees 
  JOIN salaries ON employees.emp_no = salaries.emp_no 
WHERE gender = 'F' and now()<salaries.to_date and now()<dept_emp.to_date 
AND dept_name = 'Research';--This is all current female employees currently in research department 
    '''
    checkSQL(got,q)

def checker_10(got):
    q = '''
SELECT dept_name, gender, COUNT(*) 
FROM departments NATURAL JOIN dept_emp NATURAL JOIN employees
WHERE now()<to_date
GROUP BY dept_name, gender
ORDER BY dept_name, gender; -- current employees
    '''
    checkSQL(got,q)
    
checker_1(_)

Correct!

### 2. How many employees currently work for each department (order from smallest to largest)?

In [7]:
#The checker likes those who ever worked not "currently work"!

In [8]:
%%sql

SELECT dept_name, COUNT(*) 
FROM departments NATURAL JOIN dept_emp
WHERE  now()<to_date
GROUP BY (dept_name)
ORDER BY COUNT(*) 
; --this first creates an intermediate result of all the emp dept instances and then filters for those current
-- can count the instances w/o knowing the names

9 rows affected.

[('Finance', 12437),
 ('Human Resources', 12898),
 ('Quality Management', 14546),
 ('Marketing', 14842),
 ('Research', 15441),
 ('Customer Service', 17569),
 ('Sales', 37701),
 ('Production', 53304),
 ('Development', 61386)]

### 3.  How many employees no longer work for the Research department?

the answer should be a single row and column.

In [9]:
%%sql

SELECT COUNT(*) 
FROM departments NATURAL JOIN dept_emp NATURAL JOIN employees
WHERE to_date < now() AND dept_name = 'Research'
GROUP BY departments;

1 rows affected.

[(5685,)]

### 4. give the hire date of the last employee hired in each department

In [10]:
#Three options
#Do this: last hire date of anyone ever worked in each dep. regardless if they started in that department
#The most recent one hired

In [11]:
%%sql

SELECT dept_name, MAX(hire_date) FROM departments NATURAL JOIN dept_emp NATURAL JOIN employees
GROUP BY dept_name;

9 rows affected.

[('Research', datetime.date(1999, 12, 10)),
 ('Sales', datetime.date(2000, 1, 4)),
 ('Customer Service', datetime.date(2000, 1, 2)),
 ('Marketing', datetime.date(2000, 1, 4)),
 ('Human Resources', datetime.date(2000, 1, 13)),
 ('Production', datetime.date(2000, 1, 23)),
 ('Quality Management', datetime.date(2000, 1, 28)),
 ('Development', datetime.date(2000, 1, 22)),
 ('Finance', datetime.date(2000, 1, 6))]

### 5. List names of all of the managers and their starting and ending dates who have manged the Customer Service department, order them from first to last.

In [12]:
%%sql
SELECT first_name, last_name, from_date, to_date
    FROM departments NATURAL JOIN dept_manager NATURAL JOIN employees
WHERE dept_name = 'Customer Service'
ORDER BY from_date, to_date;

4 rows affected.

[('Tonny', 'Butterworth', datetime.date(1985, 1, 1), datetime.date(1988, 10, 17)),
 ('Marjo', 'Giarratana', datetime.date(1988, 10, 17), datetime.date(1992, 9, 8)),
 ('Xiaobin', 'Spinelli', datetime.date(1992, 9, 8), datetime.date(1996, 1, 3)),
 ('Yuchang', 'Weedman', datetime.date(1996, 1, 3), datetime.date(9999, 1, 1))]

### 6. Give the first name and last name and salary of the 10 highest paid employees

In [13]:
#Use current employees - not ones left

In [14]:
%%sql

SELECT first_name, last_name, salary
    FROM employees NATURAL JOIN salaries
WHERE now() < to_date
ORDER BY salary DESC
LIMIT 10;

10 rows affected.

[('Tokuyasu', 'Pesch', 158220),
 ('Honesty', 'Mukaidono', 156286),
 ('Xiahua', 'Whitcomb', 155709),
 ('Sanjai', 'Luders', 155513),
 ('Tsutomu', 'Alameldin', 155190),
 ('Willard', 'Baca', 154459),
 ('Lidong', 'Meriste', 154376),
 ('Charmane', 'Griswold', 153715),
 ('Weijing', 'Chenoweth', 152710),
 ('Weicheng', 'Hatcliff', 152687)]

### 7. Give the first name, last name, salary, and title of the 10 highest paid employees

In [15]:
#current employees

In [16]:
%%sql
SELECT first_name, last_name, salary, title
    FROM employees NATURAL JOIN salaries JOIN titles ON titles.emp_no = employees.emp_no
WHERE now() < titles.to_date and now() < salaries.to_date
ORDER BY salary DESC
LIMIT 10;

10 rows affected.

[('Tokuyasu', 'Pesch', 158220, 'Senior Staff'),
 ('Honesty', 'Mukaidono', 156286, 'Senior Staff'),
 ('Xiahua', 'Whitcomb', 155709, 'Senior Staff'),
 ('Sanjai', 'Luders', 155513, 'Senior Staff'),
 ('Tsutomu', 'Alameldin', 155190, 'Senior Staff'),
 ('Willard', 'Baca', 154459, 'Senior Staff'),
 ('Lidong', 'Meriste', 154376, 'Senior Staff'),
 ('Charmane', 'Griswold', 153715, 'Senior Staff'),
 ('Weijing', 'Chenoweth', 152710, 'Senior Staff'),
 ('Weicheng', 'Hatcliff', 152687, 'Senior Staff')]

### 8. Give the  first and last name, salary, and department of the 10 lowest paid employees

In [17]:
#current employees

In [18]:
%%sql
SELECT first_name, last_name, salary, dept_name
    FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments 
    JOIN salaries ON salaries.emp_no = employees.emp_no
WHERE now() < salaries.to_date and now() < dept_emp.to_date
ORDER BY salary
LIMIT 10;

10 rows affected.

[('Olivera', 'Baek', 38623, 'Production'),
 ('Pascal', 'Lueh', 38936, 'Human Resources'),
 ('Sachar', 'Nicolson', 38942, 'Quality Management'),
 ('Yurij', 'Narwekar', 39012, 'Finance'),
 ('Oldrich', 'Schmiedel', 39036, 'Development'),
 ('Gianluca', 'Talmor', 39117, 'Quality Management'),
 ('Marie', 'Marrakchi', 39186, 'Research'),
 ('Xiaopeng', 'Piancastelli', 39227, 'Human Resources'),
 ('Angus', 'Schlumberger', 39264, 'Research'),
 ('Vidar', 'Turnbull', 39285, 'Production')]

### 9. What is the average salary of a female in the research department?

In [19]:
#all time employees, not just current

In [20]:
%%sql

SELECT TO_CHAR(AVG(salary), '999,999.99')
FROM  departments 
  NATURAL JOIN dept_emp 
  NATURAL JOIN employees 
  JOIN salaries ON employees.emp_no = salaries.emp_no 
WHERE gender = 'M' and now()<salaries.to_date and now()<dept_emp.to_date 
AND dept_name = 'Sales';--This is all current female employees currently in research department

1 rows affected.

[('  88,864.20',)]

### 10. Show the number of males and females in each department.

the department names should be sorted and the count of females should be listed before the count of males for each department.

In [21]:
#all time employees, not just current

In [22]:
%%sql

SELECT dept_name, gender, COUNT(*) 
FROM departments NATURAL JOIN dept_emp NATURAL JOIN employees
WHERE now()<to_date
GROUP BY dept_name, gender
ORDER BY dept_name, gender; -- current employees

18 rows affected.

[('Customer Service', 'F', 7007),
 ('Customer Service', 'M', 10562),
 ('Development', 'F', 24533),
 ('Development', 'M', 36853),
 ('Finance', 'F', 5014),
 ('Finance', 'M', 7423),
 ('Human Resources', 'F', 5147),
 ('Human Resources', 'M', 7751),
 ('Marketing', 'F', 5864),
 ('Marketing', 'M', 8978),
 ('Production', 'F', 21393),
 ('Production', 'M', 31911),
 ('Quality Management', 'F', 5872),
 ('Quality Management', 'M', 8674),
 ('Research', 'F', 6181),
 ('Research', 'M', 9260),
 ('Sales', 'F', 14999),
 ('Sales', 'M', 22702)]